tap "d12frosted/emacs-plus"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Platform built on V8 to build network applications
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# GNU compiler collection
brew "gcc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Sound and music computing system
brew "csound"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Generic library support script
brew "libtool"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Move, copy, append, and link multiple files
brew "mmv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@31"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Flexible space to create your own interactive software
cask "cycling74-max"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Run LLMs locally
cask "gpt4all"
# Open-source video transcoder
cask "handbrake-app"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Email client integrated with Notion workspace
cask "notion-mail"
# Home media player
cask "plex"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Server, language, and IDE for sound synthesis and algorithmic composition
cask "supercollider"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "766b.go-outliner"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bbenoist.nix"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dendron.adjust-heading-level"
vscode "docker.docker"
vscode "draivin.hscopes"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jinliming2.vscode-go-template"
vscode "leneti.yaml-fm-lint"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "orangex4.regexr-vscode"
vscode "pulkitgangwar.nextjs-snippets"
vscode "scvsc.scvsc"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "yatki.vscode-surround"
vscode "yzhang.markdown-all-in-one"
