tap "1password/tap"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
# Official Amazon AWS command-line interface
brew "awscli"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cross-platform make
brew "cmake"
# Sound and music computing system
brew "csound"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast, simple, recursive content discovery tool written in Rust
brew "feroxbuster"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Text-to-HTML conversion tool
brew "markdown"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Tool for managing OCI containers and pods
brew "podman"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# UNIX shell (command interpreter)
brew "zsh"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organizer
cask "bartender"
# Web security testing toolkit
cask "burp-suite"
# E-books management software
cask "calibre"
# Flexible space to create your own interactive software
cask "cycling74-max"
# Voice and text chat software
cask "discord"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
cask "emacs-mac"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Remote desktop client
cask "microsoft-remote-desktop"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mouse-fix"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Visual programming language for multimedia
cask "pd"
# Home media player
cask "plex"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Control your tools with a few keystrokes
cask "raycast"
# Digital audio production application
cask "reaper"
# Data science software focusing on R and Python
cask "rstudio"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# EPUB ebook editor
cask "sigil"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Modular synthesizer
cask "sunvox"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Open-source virtual modular synthesizer
cask "vcv-rack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Simple menu bar app to download YouTube movies
cask "youtube-downloader"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot-labs"
vscode "GitHub.copilot-nightly"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "nicollasr.vscode-streamdeck"
vscode "PulkitGangwar.nextjs-snippets"
vscode "ritwickdey.LiveServer"
vscode "vscodevim.vim"
